benchmark/results/actix_json.txt
Bombarding http://127.0.0.1:3002/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    112556.60   12533.20  135867.13
  Latency        1.11ms   432.50us    20.33ms
  HTTP codes:
    1xx - 0, 2xx - 1125831, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.58MB/s