benchmark/results/axum_json.txt
Bombarding http://127.0.0.1:3001/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    112075.84    7031.49  137567.81
  Latency        1.11ms   256.79us    13.30ms
  HTTP codes:
    1xx - 0, 2xx - 1121115, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.49MB/s