benchmark/results/axum_json.txt
Bombarding http://axum:3000/json for 10s using 125 connection(s)



 00m09s
 00m09s
 00m09s
 00m08s
 00m08s
 00m08s
[...]
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     19468.15    7357.98   58399.75
  Latency        6.46ms     5.40ms      0.95s
  HTTP codes:
    1xx - 0, 2xx - 192860, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.60MB/s