benchmark/results/axum_plaintext.txt
Bombarding http://axum:3000/ for 10s using 125 connection(s)



 00m09s
 00m09s
 00m08s
 00m08s
 00m08s
[...]
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     27418.26    9998.82   52021.12
  Latency        4.55ms     4.46ms      1.02s
  HTTP codes:
    1xx - 0, 2xx - 273711, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.87MB/s