benchmark/results/fiber_json.txt
Bombarding http://127.0.0.1:3007/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    110825.31    9427.26  133292.19
  Latency        1.12ms   472.98us    17.17ms
  HTTP codes:
    1xx - 0, 2xx - 1108472, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.24MB/s