benchmark/results/fiber_plaintext.txt
Bombarding http://127.0.0.1:3007/ for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    114878.31    8080.51  133924.76
  Latency        1.08ms   387.74us    42.61ms
  HTTP codes:
    1xx - 0, 2xx - 1149895, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.05MB/s