benchmark/results/gin_json.txt
Bombarding http://127.0.0.1:3006/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     35856.79   13451.92   71476.24
  Latency        3.48ms     2.09ms    37.28ms
  HTTP codes:
    1xx - 0, 2xx - 358690, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.39MB/s