benchmark/results/gin_plaintext.txt
Bombarding http://gin:3000/ for 10s using 125 connection(s)



 00m09s
 00m09s
 00m09s
[...]
 00m08s
 00m08s
 00m08s
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     21452.38   12732.67   55507.96
  Latency        5.87ms     8.69ms      1.95s
  HTTP codes:
    1xx - 0, 2xx - 211329, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.75MB/s