benchmark/results/gin_plaintext.txt
Bombarding http://127.0.0.1:3006/ for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     34484.73   12814.16   67775.43
  Latency        3.61ms     2.18ms    38.43ms
  HTTP codes:
    1xx - 0, 2xx - 345795, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.33MB/s