benchmark/results/leptos_json.txt
Bombarding http://127.0.0.1:3005/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     61585.17   20302.18  105935.66
  Latency        2.03ms     3.70ms    59.05ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 613275
  Errors:
    dial tcp 127.0.0.1:3005: connect: connection refused - 613275
  Throughput:       0.00/s