benchmark/results/leptos_plaintext.txt
Bombarding http://127.0.0.1:3005/ for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     43919.60   11071.10   76015.81
  Latency        2.86ms     5.40ms    77.32ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 433636
  Errors:
    dial tcp 127.0.0.1:3005: connect: connection refused - 433636
  Throughput:       0.00/s