benchmark/results/loco_json.txt
Bombarding http://127.0.0.1:3003/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    103706.65   14970.08  119465.66
  Latency        1.20ms   495.01us    23.53ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1037087
  Errors:
    dial tcp 127.0.0.1:3003: connect: connection refused - 1037087
  Throughput:       0.00/s