benchmark/results/loco_plaintext.txt
Bombarding http://127.0.0.1:3003/ for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     90338.83   13681.57  125730.11
  Latency        1.38ms     1.22ms    34.23ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 900923
  Errors:
    dial tcp 127.0.0.1:3003: connect: connection refused - 900923
  Throughput:       0.00/s